//Урок 3

import UIKit



//: ## Конструкция if
/*:
    if condition {
        some code
    }
 
*/
print("====КОНСТРУКЦИЯ if====")



/*:
    if conditionOne {
        some code
    } else if conditionTwo {
        some code
    }
*/
print("\n====КОНСТРУКЦИЯ else if====")



/*:
    if conditionOne {
        some code
    } else if conditionTwo {
        some code
    } else {
        some code
    }
 */
print("\n====КОНСТРУКЦИЯ if-else====")



//: ### Тернарный оператор
print("\n====ТЕРНАРНЫЙ ОПЕРАТОР====")



//: ## Switch statement


/*:
    switch значение для сопоставления {
    case значение 1:
        инструкция для первого значения
    case значение 2, значение 3:
        инструкция для второго и третьего значения
    default:
        инструкция, если совпадений с шаблонами не найдено
    }
*/

print("====SWITCH STATEMENT====")



//: ### Соответствие диапазону

print("====СООТВЕТСТВИЕ ДИАПАЗОНУ====")



//: ## Опциональные типы



//: ### Извлечение опционалов


//: ### Принудительное извлечение опционалов



//: ### Привязка опционалов


//: ### Неявно извлеченные опционалы

