import UIKit

//: # Урок 4. Типы коллекций
//: ## Массивы
//: > Хранят в себе упорядоченные, но при этом не уникальные значения одного типа

 // Неизменяемый массив с типом данных String
let strings = ["a", "b", "c"]

 // Неизменяемый массив с типом данных Character
let characters: [Character] = ["a", "b", "c"]

 // Пустой массив с типом Int
var integers = [Int]()
var numbers: [Int] = []

 // Присваивание данных массиву


 // Теперь наш массив имеет другие данные


 // Добавление новых значений к уже существующим


 // Добавление новго значения при помощи метода append


 // Добавление нового элемента по индексу




 // Создание нового массива, путём объеденения двух других массивов


 //Удаление последнего элемента из массива и сохранение его в константе


 //Результат после удаления последнего элемента


 //Удаление первого элемента из массива и сохранение его в константе


 // Результат после удаления первого элемента


 // Удаление значения по индексу


 // Результат после удаления значение по индексу


 // Количество элементов массива


 // Удаление всех элементов массива


 // Обнуление массива путём присваивания ему пустого массиву




 // Замена значения по индексу 2 на новое значение


 // Результат после замены


//: ### Использование логического свойства isEmpty



//: [Next](@next)
