/*:
 ## Lesson 1
 */

import UIKit

/*:
 ## Комментарий к строке кода
 **Здесь можно писать**
 *много много много*
 > много текста
*/

var str = "Hello, playground"

/*:
 ### Переменные
*/



/*:
 > Футбол - это командный вид спорта с мячом, в котором целью является забить мяч в ворота соперника. Футбол это не просто вид спорта, футбол - это стиль жизни, футбол - это философия. Футбол, вид спорта для сильных духом и целеустремленных людей. Я люблю футбол. Футбол мой любимый вид спорта!
 */

let teamSport = "Футбол"

print("Футбол - это командный вид спорта с мячом, в котором целью является забить мяч в ворота соперника. Футбол это не просто вид спорта, футбол - это стиль жизни, футбол - это философия. Футбол, вид спорта для сильных духом и целеустремленных людей. Я люблю футбол. Футбол мой любимый вид спорта!")

/*:
 ### Базовые типы
*/



/*:
 ### Базовые типы в Swift.
*/
/*:
 ### Строковые типы - String
*/



/*:
 ### Числовые типы
 #### Int
*/



/*:
 #### Double
*/



/*:
 #### Float
*/



/*:
 ### Булево значения
*/



/*:
 ### Приведение типов
*/


