/*:
 ## Lesson 1
 */

import UIKit

/*:
 ## Комментарий к строке кода
 **Здесь можно писать**
 *много много много*
 > много текста
*/

var str = "Hello, playground"

/*:
 ### Переменные
*/



/*:
 > Футбол - это командный вид спорта с мячом, в котором целью является забить мяч в ворота соперника. Футбол это не просто вид спорта, футбол - это стиль жизни, футбол - это философия. Футбол, вид спорта для сильных духом и целеустремленных людей. Я люблю футбол. Футбол мой любимый вид спорта!
 */

var teamSport = "Футбол"

print("\(teamSport) - это командный вид спорта с мячом, в котором целью является забить мяч в ворота соперника. \(teamSport) это не просто вид спорта, \(teamSport.lowercased()) - это стиль жизни, \(teamSport.lowercased()) - это философия. \(teamSport), вид спорта для сильных духом и целеустремленных людей. Я люблю \(teamSport.lowercased()). \(teamSport) мой любимый вид спорта!\n")

teamSport = "Американский футбол"

print("\(teamSport) - это командный вид спорта с мячом, в котором целью является забить мяч в ворота соперника. \(teamSport) это не просто вид спорта, \(teamSport.lowercased()) - это стиль жизни, \(teamSport.lowercased()) - это философия. \(teamSport), вид спорта для сильных духом и целеустремленных людей. Я люблю \(teamSport.lowercased()). \(teamSport) мой любимый вид спорта!")

/*:
 ### Базовые типы
*/

//teamSport = 10

/*:
 ### Базовые типы в Swift.
*/
/*:
 ### Строковые типы - String
*/

var userName = ""
print("Hello, \(userName)")

/*:
 ### Числовые типы
 #### Int
*/

var age = 0
print()

/*:
 #### Double
*/



/*:
 #### Float
*/



/*:
 ### Булево значения
*/



/*:
 ### Приведение типов
*/


